# GetAllConstrainedHandles Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraintsManager..::..GetAllConstrainedHandles Method
RebarConstraintsManager Class See Also
---
Retrieves all handles on the Rebar that are constrained to external references.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<RebarConstrainedHandle> GetAllConstrainedHandles()
```

Visual Basic
---
```text
Public Function GetAllConstrainedHandles As IList(Of RebarConstrainedHandle)
```

Visual C++
---
```text
public:
IList<RebarConstrainedHandle^>^ GetAllConstrainedHandles()
```

# ### Return Value
A collection of RebarConstrainedHandles
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The RebarConstraintsManager does not manage a valid Rebar element. |

# See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace